#возведение в отрицательную степень через цикл
def my_func(x, y):
    sum_arg = 1
    if y < 0:
        for i in range(abs(y)):
            sum_arg *= x
        return 1/sum_arg
    else:
        print("программа работает только для  отрицательной степени, вторая переменна должна быть отрицательной")


print(my_func(2, -6))

#возведение в степень через оператор "**"

x = float(input("введите действительное положительное число"))
y = int(input("введите целое отрицательное число"))


def my_func_2(x, y):
    return x ** y


print(my_func_2(x, y))


