#Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел.
#Проверить работу исключения на реальном примере.
#Необходимо запрашивать у пользователя данные и заполнять список.
#Класс-исключение должен контролировать типы данных элементов списка.
#Примечание: длина списка не фиксирована.
#Элементы запрашиваются бесконечно, пока пользователь сам не остановит работу скрипта, введя, например, команду “stop”.
#При этом скрипт завершается, сформированный список выводится на экран.
class DigitList(Exception):
    def __str__(self):
        return "введенный элемент не является числом"

lst=[]

while True:
    elem = input('введите элемент ')
    try:
        if elem.isdigit()==False:
            raise DigitList
        else:
            lst.append(elem)
    except DigitList as e:
        print(e)
    if elem=='stop':
       break

print(lst)


